stuartpittaway/diyBMSv4ESP32/ESP32BoardTest/src/main.cpp
/*
 ____  ____  _  _  ____  __  __  ___    _  _  __
(  _ \(_  _)( \/ )(  _ \(  \/  )/ __)  ( \/ )/. |
 )(_) )_)(_  \  /  ) _ < )    ( \__ \   \  /(_  _)
(____/(____) (__) (____/(_/\/\_)(___/    \/   (_)

  (c) 2017 to 2021 Stuart Pittaway

BOARD TEST CODE FOR USE AFTER BUILDING CONTROLLER PCB


TEST LED

RED/BLUE = FAILED SD CARD DETECTION OR WRITE
RED/PURPLE = TCA9534APWR error
RED/GREEN = TCA6408 Error
RED/WHITE = TX1/RX1 error (make sure loop cable is connected!)

Quickly flashing Green = All good
*/

#if defined(ESP8266)
#error ESP8266 is not supported by this code
#endif

#define USE_ESP_IDF_LOG 1
static constexpr const char *const TAG = "diybms";

#undef CONFIG_DISABLE_HAL_LOCKS

#include <Arduino.h>

#include "FS.h"
#include "SD.h"
#include <LITTLEFS.h>
#include <WiFi.h>
#include <SPI.h>
#include "driver/gpio.h"
#include "driver/twai.h"
#include "driver/adc.h"
#include <driver/uart.h>
//#include <XPT2046_Touchscreen.h>
#include "TFT_eSPI.h"
#include "driver/i2c.h"
#include "esp32-hal-i2c.h"

#define TOUCH_IRQ GPIO_NUM_36
#define TOUCH_CHIPSELECT GPIO_NUM_4
#define SDCARD_CHIPSELECT GPIO_NUM_5

#define SERIAL_DATA Serial2
#define SERIAL_DEBUG Serial
#define SERIAL_RS485 Serial1

#define TCA6416_INTERRUPT_PIN GPIO_NUM_39
#define TCA6416_ADDRESS 0x21
#define TCA6416_INPUT 0x00
#define TCA6416_OUTPUT 0x02
#define TCA6416_POLARITY_INVERSION 0x04
#define TCA6416_CONFIGURATION 0x06
// byte 1   * byte 2
// P7 to P0 * P17 to P10
// 00000000 * 11010000
//  P17, 16 and 14 are inputs
//  i2c output is written as low byte, high byte
#define TCA6416_INPUTMASK 0xD000

// GPIO34 (input only pin)
#define TCA9534A_INTERRUPT_PIN GPIO_NUM_34
#define TCA9534APWR_ADDRESS 0x38
#define TCA9534APWR_INPUT 0x00
#define TCA9534APWR_OUTPUT 0x01
#define TCA9534APWR_POLARITY_INVERSION 0x02
#define TCA9534APWR_CONFIGURATION 0x03
#define TCA9534APWR_INPUTMASK B10000000

// GPIO39 (input only pin)
#define TCA6408_INTERRUPT_PIN GPIO_NUM_39
#define TCA6408_ADDRESS 0x20
#define TCA6408_INPUT 0x00
#define TCA6408_OUTPUT 0x01
#define TCA6408_POLARITY_INVERSION 0x02
#define TCA6408_CONFIGURATION 0x03
#define TCA6408_INPUTMASK B00001111

#define VSPI_SCK GPIO_NUM_18

#define RS485_RX GPIO_NUM_21
#define RS485_TX GPIO_NUM_22
#define RS485_ENABLE GPIO_NUM_25

enum RGBLED : uint8_t
{
    OFF = 0,
    Blue = B00000001,
    Red = B00000010,
    Purple = B00000011,
    Green = B00000100,
    Cyan = B00000101,
    Yellow = B00000110,
    White = B00000111
};

SPIClass vspi;
// Copy of pin state for TCA9534
uint8_t TCA9534APWR_Value;
// Copy of pin state for TCA6408
uint8_t TCA6408_Value;

TFT_eSPI tft = TFT_eSPI();
// Don't enable IRQ on touchscreen class (we do that later)
// XPT2046_Touchscreen touchscreen(TOUCH_CHIPSELECT, TOUCH_IRQ);

// Prototype functions
void Halt(RGBLED colour);

uint8_t readByte(i2c_port_t i2c_num, uint8_t dev, uint8_t reg)
{
    // We use the native i2c commands for ESP32 as the Arduino library
    // seems to have issues with corrupting i2c data if used from multiple threads

    uint8_t data;
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();
    // Select the correct register on the i2c device
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, (dev << 1) | I2C_MASTER_WRITE, true);
    i2c_master_write_byte(cmd, reg, true);
    // Send repeated start, and read the register
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, (dev << 1) | I2C_MASTER_READ, true);
    // Read single byte and expect NACK in reply
    i2c_master_read_byte(cmd, &data, i2c_ack_type_t::I2C_MASTER_NACK);
    i2c_master_stop(cmd);
    // esp_err_t ret =
    ESP_ERROR_CHECK_WITHOUT_ABORT(i2c_master_cmd_begin(i2c_num, cmd, pdMS_TO_TICKS(100)));

    // ESP_LOGD(TAG,"I2C reply %i",ret);

    i2c_cmd_link_delete(cmd);

    return data;
}

uint16_t read16bitWord(i2c_port_t i2c_num, uint8_t dev, uint8_t reg)
{
    // We use the native i2c commands for ESP32 as the Arduino library
    // seems to have issues with corrupting i2c data if used from multiple threads
    uint8_t data1;
    uint8_t data2;
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();
    // Select the correct register on the i2c device
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, (dev << 1) | I2C_MASTER_WRITE, true);
    i2c_master_write_byte(cmd, reg, true);
    // Send repeated start, and read the register
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, (dev << 1) | I2C_MASTER_READ, true);
    // Read 1 byte and expect ACK in reply
    i2c_master_read(cmd, &data1, 1, i2c_ack_type_t::I2C_MASTER_ACK);
    // Read 1 byte and expect NACK in reply
    i2c_master_read(cmd, &data2, 1, i2c_ack_type_t::I2C_MASTER_NACK);
    i2c_master_stop(cmd);
    // esp_err_t ret =
    ESP_ERROR_CHECK_WITHOUT_ABORT(i2c_master_cmd_begin(i2c_num, cmd, pdMS_TO_TICKS(100)));

    i2c_cmd_link_delete(cmd);

    return (((uint16_t)data2 << 8) | (uint16_t)data1);
}

// i2c: Writes a single byte to a slave devices register
esp_err_t write16bitWord(i2c_port_t i2c_num, uint8_t deviceAddress, uint8_t i2cregister, uint16_t data)
{
    // We use the native i2c commands for ESP32 as the Arduino library
    // seems to have issues with corrupting i2c data if used from multiple threads
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, (deviceAddress << 1) | I2C_MASTER_WRITE, true);

    uint8_t buffer[3];
    buffer[0] = i2cregister;
    buffer[1] = (uint8_t)(data & 0x00FF);
    buffer[2] = (uint8_t)(data >> 8);
    i2c_master_write(cmd, buffer, sizeof(buffer), true);
    i2c_master_stop(cmd);

    esp_err_t ret = ESP_ERROR_CHECK_WITHOUT_ABORT(i2c_master_cmd_begin(i2c_num, cmd, pdMS_TO_TICKS(100)));
    i2c_cmd_link_delete(cmd);

    return ret;
}

esp_err_t writeByte(i2c_port_t i2c_num, uint8_t deviceAddress, uint8_t i2cregister, uint8_t data)
{
    // We use the native i2c commands for ESP32 as the Arduino library
    // seems to have issues with corrupting i2c data if used from multiple threads
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, (deviceAddress << 1) | I2C_MASTER_WRITE, true);
    i2c_master_write_byte(cmd, i2cregister, true);
    i2c_master_write_byte(cmd, data, true);
    i2c_master_stop(cmd);

    esp_err_t ret = ESP_ERROR_CHECK_WITHOUT_ABORT(i2c_master_cmd_begin(i2c_num, cmd, pdMS_TO_TICKS(100)));
    i2c_cmd_link_delete(cmd);
    return ret;
}

uint8_t ReadTCA6408InputRegisters()
{
    TCA6408_Value = readByte(I2C_NUM_0, TCA6408_ADDRESS, TCA6408_INPUT);
    return TCA6408_Value & TCA6408_INPUTMASK;
}

