stuartpittaway/diyBMSv4ESP32/ESP32BoardTest/src/main.cpp
uint8_t ReadTCA9534InputRegisters()
{
    TCA9534APWR_Value = readByte(I2C_NUM_0, TCA9534APWR_ADDRESS, TCA9534APWR_INPUT);
    return TCA9534APWR_Value & TCA9534APWR_INPUTMASK;
}

void ConfigurePins()
{
    // GPIO39 is interrupt pin from TCA6408 (doesnt have pull up/down resistors)
    pinMode(TCA6408_INTERRUPT_PIN, INPUT);

    // GPIO34 is interrupt pin from TCA9534A (doesnt have pull up/down resistors)
    pinMode(TCA9534A_INTERRUPT_PIN, INPUT);

    // BOOT Button on ESP32 module is used for resetting wifi details
    pinMode(GPIO_NUM_0, INPUT_PULLUP);
    // attachInterrupt(GPIO_NUM_0, WiFiPasswordResetInterrupt, CHANGE);

    // For touch screen
    pinMode(TOUCH_IRQ, INPUT_PULLUP);
    // attachInterrupt(TOUCH_IRQ, TFTScreenTouchInterrupt, FALLING);

    // Configure the CHIP SELECT pins as OUTPUT and set HIGH
    pinMode(TOUCH_CHIPSELECT, OUTPUT);
    digitalWrite(TOUCH_CHIPSELECT, HIGH);
    pinMode(SDCARD_CHIPSELECT, OUTPUT);
    digitalWrite(SDCARD_CHIPSELECT, HIGH);

    pinMode(RS485_ENABLE, OUTPUT);
    // Enable receive
    digitalWrite(RS485_ENABLE, LOW);
}

// Attempts connection to i2c device
esp_err_t Testi2cAddress(i2c_port_t port, uint8_t address)
{
    int ret;
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, (address << 1) | I2C_MASTER_WRITE, 1);
    i2c_master_stop(cmd);
    ret = i2c_master_cmd_begin(port, cmd, 100 / portTICK_RATE_MS);
    i2c_cmd_link_delete(cmd);
    return ret;
}

// Input pin state for TCA9534
uint8_t TCA9534APWR_Input;
// Input pin state for TCA6408
uint8_t TCA6408_Input;
// Input pin state for TCA6416
uint16_t TCA6416_Input;

// Output pin state for TCA9534
uint8_t TCA9534APWR_Output_Pins;
// Output pin state for TCA6408
uint8_t TCA6408_Output_Pins;
// Output pin state for TCA6416
uint16_t TCA6416_Output_Pins;
bool TCA6416_Fitted;

// 16 bit register
uint16_t ReadTCA6416InputRegisters()
{
    // Update the copy of the pin state
    TCA6416_Input = read16bitWord(I2C_NUM_0, TCA6416_ADDRESS, TCA6416_INPUT) & (uint16_t)TCA6416_INPUTMASK;

    // As the TCA6416 pins as mapped similarly to the older style controller with 2 I/O chips
    // we map the inputs to fake the other devices.

    // TCA6416A pins P0-7 match the old TCA6408 pin out
    TCA6408_Input = TCA6416_Input & 0x00FF;
    TCA9534APWR_Input = (TCA6416_Input >> 8) & (uint16_t)0x00FF;

    // ESP_LOGD(TAG, "TCA6416 input=%#04x, TCA6408=%x, TCA9534=%x", TCA6416_Input, TCA6408_Input, TCA9534APWR_Input);

    return TCA6416_Input;
}

void WriteTCA6416OutputState()
{
    // Emulate the 9534 + 6408 and set the state on the 16 bit output
    TCA6416_Output_Pins = ((uint16_t)TCA9534APWR_Output_Pins << 8) | TCA6408_Output_Pins;
    ESP_ERROR_CHECK_WITHOUT_ABORT(write16bitWord(I2C_NUM_0, TCA6416_ADDRESS, TCA6416_OUTPUT, TCA6416_Output_Pins));

    // Update the "slave" pins to emulate those devices being installed
    TCA6408_Output_Pins = TCA6416_Output_Pins & 0x00FF;
    TCA9534APWR_Output_Pins = (TCA6416_Output_Pins >> 8) & 0x00FF;
}

void ConfigureI2C()
{
    ESP_LOGI(TAG, "Configure I2C");

    // SDA / SCL
    // ESP32 = I2C0-SDA / I2C0-SCL
    // I2C Bus 1: uses GPIO 27 (SDA) and GPIO 26 (SCL);
    // I2C Bus 2: uses GPIO 33 (SDA) and GPIO 32 (SCL);

    // Initialize
    i2c_config_t conf = {
        .mode = I2C_MODE_MASTER,
        .sda_io_num = gpio_num_t::GPIO_NUM_27,
        .scl_io_num = gpio_num_t::GPIO_NUM_26,
        .sda_pullup_en = GPIO_PULLUP_DISABLE,
        .scl_pullup_en = GPIO_PULLUP_DISABLE,
        .clk_flags = I2C_SCLK_SRC_FLAG_FOR_NOMAL};

    // 400khz
    conf.master.clk_speed = 400000;

    ESP_ERROR_CHECK(i2c_param_config(I2C_NUM_0, &conf));
    ESP_ERROR_CHECK(i2c_driver_install(I2C_NUM_0, conf.mode, 0, 0, 0));

    // Test to see if we have a TCA6416 on the i2c bus, if we have, its a newer controller board V4.4+
    // on power up the chip has all ports are inputs

    ESP_LOGI(TAG, "Scanning i2c bus");
    for (uint8_t i = 1; i < 127; i++)
    {
        if (Testi2cAddress(I2C_NUM_0, i) == ESP_OK)
        {
            ESP_LOGI(TAG, "Found i2c device at address 0x%2x", i);
        }
    }

    if (Testi2cAddress(I2C_NUM_0, TCA6416_ADDRESS) == ESP_OK)
    {
        ESP_LOGI(TAG, "Found TCA6416A");

        ESP_ERROR_CHECK(write16bitWord(I2C_NUM_0, TCA6416_ADDRESS, TCA6416_OUTPUT, 0));

        TCA6416_Fitted = true;

        // Set configuration
        ESP_ERROR_CHECK(write16bitWord(I2C_NUM_0, TCA6416_ADDRESS, TCA6416_CONFIGURATION, TCA6416_INPUTMASK));

        // Update our copy of pin state registers
        ReadTCA6416InputRegisters();

        // All off
        TCA6416_Output_Pins = 0;
        WriteTCA6416OutputState();

        /*
    TCA6416A pins P0-7 match the old TCA6408 pin out
    */
        // P0=EXT_IO_A
        // P1=EXT_IO_B
        // P2=EXT_IO_C
        // P3=EXT_IO_D
        // P4=RELAY 1
        // P5=RELAY 2
        // P6=RELAY 3 (SSR)
        // P7=RELAY 4 (SSR)

        /*
    TCA6416 pins P10-17 match the old TCA9534 pin out
    */
        // P10= BLUE
        // P11= RED
        // P12= GREEN
        // P13= DISPLAY BACKLIGHT LED
        // P14= push button 1
        // P15= NOT USED
        // P16= push button 2
        // P17= ESTOP (pull to ground to trigger)

        // INTERRUPT PIN = ESP32 IO39
        // isr_param tca6416_param = {.pin = TCA6416_INTERRUPT_PIN, .handler = TCA6416Interrupt};
        // ESP_ERROR_CHECK(esp_ipc_call_blocking(PRO_CPU_NUM, ipc_interrupt_attach, &tca6416_param));
        // ipc_interrupt_attach(&tca6416_param);

        return;
    }
    else
    {
        ESP_LOGI(TAG, "TCA6416A not fitted, assume v4.2 board");

        // https://datasheet.lcsc.com/szlcsc/1809041633_Texas-Instruments-TCA9534APWR_C206010.pdf
        // TCA9534APWR Remote 8-Bit I2C and Low-Power I/O Expander With Interrupt Output and Configuration Registers
        // https://lcsc.com/product-detail/Interface-I-O-Expanders_Texas-Instruments-TCA9534APWR_C206010.html
        // A0/A1/A2 are LOW, so i2c address is 0x38

