stuartpittaway/diyBMSv4ESP32/ESP32BoardTest/src/main.cpp
        // PINS
        // P0= BLUE
        // P1= RED
        // P2= GREEN
        // P3= DISPLAY BACKLIGHT LED
        // P4= SPARE on J13
        // P5= Canbus RS
        // P6= SPARE on J13
        // P7= ESTOP (pull to ground to trigger)
        // INTERRUPT PIN = ESP32 IO34

        // BIT  76543210
        // PORT 76543210
        // MASK=10000000

        if (Testi2cAddress(I2C_NUM_0, TCA9534APWR_ADDRESS) != ESP_OK)
        {
            ESP_LOGE(TAG, "TCA9534APWR Error");
            Halt(RGBLED::Purple);
        }

        // All off
        ESP_ERROR_CHECK(writeByte(I2C_NUM_0, TCA9534APWR_ADDRESS, TCA9534APWR_OUTPUT, 0));

        // 0×03 Configuration, P7 (estop) and P4 (remote touch) as input, others outputs (0=OUTPUT)
        ESP_ERROR_CHECK(writeByte(I2C_NUM_0, TCA9534APWR_ADDRESS, TCA9534APWR_CONFIGURATION, TCA9534APWR_INPUTMASK));
        ReadTCA9534InputRegisters();
        TCA9534APWR_Output_Pins = readByte(I2C_NUM_0, TCA9534APWR_ADDRESS, TCA9534APWR_OUTPUT);

        // ESP_LOGD(TAG, "About to configure interrupt...");
        // isr_param tca9534_param = {.pin = TCA9534A_INTERRUPT_PIN, .handler = TCA9534AInterrupt};
        // ESP_ERROR_CHECK(esp_ipc_call_blocking(PRO_CPU_NUM, ipc_interrupt_attach, &tca9534_param));
        // ipc_interrupt_attach(&tca9534_param);

        ESP_LOGI(TAG, "Found TCA9534A");

        /*
    Now for the TCA6408
    */

        // P0=EXT_IO_A
        // P1=EXT_IO_B
        // P2=EXT_IO_C
        // P3=EXT_IO_D
        // P4=RELAY 1
        // P5=RELAY 2
        // P6=RELAY 3 (SSR)
        // P7=RELAY 4 (SSR)

        if (Testi2cAddress(I2C_NUM_0, TCA6408_ADDRESS) != ESP_OK)
        {
            ESP_LOGE(TAG, "TCA6408 Error");
            Halt(RGBLED::Green);
        }

        // Set ports to off before we set configuration
        ESP_ERROR_CHECK(writeByte(I2C_NUM_0, TCA6408_ADDRESS, TCA6408_OUTPUT, 0));

        // Ports A/B/C/D/E inputs, RELAY1/2/3 outputs
        ESP_ERROR_CHECK(writeByte(I2C_NUM_0, TCA6408_ADDRESS, TCA6408_CONFIGURATION, TCA6408_INPUTMASK));
        ReadTCA6408InputRegisters();
        TCA6408_Output_Pins = readByte(I2C_NUM_0, TCA6408_ADDRESS, TCA6408_OUTPUT);

        ESP_LOGI(TAG, "Found TCA6408");
        // isr_param tca6408_param = {.pin = TCA6408_INTERRUPT_PIN, .handler = TCA6408Interrupt};
        // ESP_ERROR_CHECK(esp_ipc_call_blocking(PRO_CPU_NUM, ipc_interrupt_attach, &tca6408_param));
        // ipc_interrupt_attach(&tca6408_param);
        TCA6416_Fitted = false;

        return;
    }

    // Didn't find anything on i2c bus
    ESP_LOGE(TAG, "No TCA chip found on i2c bus");
    Halt(RGBLED::Cyan);
}

void Led(uint8_t bits)
{
    // Clear LED pins
    TCA9534APWR_Value = TCA9534APWR_Value & B11111000;
    // Set on
    TCA9534APWR_Value = TCA9534APWR_Value | (bits & B00000111);
    // esp_err_t ret =
    ESP_ERROR_CHECK_WITHOUT_ABORT(writeByte(I2C_NUM_0, TCA9534APWR_ADDRESS, TCA9534APWR_OUTPUT, TCA9534APWR_Value));
}

// Infinite loop flashing the LED RED/WHITE
void Halt(RGBLED colour)
{
    while (true)
    {
        Led(RGBLED::Red);
        delay(700);
        Led(colour);
        delay(300);
    }
}

void ConfigureVSPI()
{
    vspi.endTransaction();
    vspi.end();
    // VSPI
    // GPIO23 (MOSI), GPIO19(MISO), GPIO18(CLK) and GPIO5 (CS)
    vspi.begin(18, 19, 23, -1);
    // Don't use hardware chip selects on VSPI
    vspi.setHwCs(false);
    vspi.setBitOrder(MSBFIRST);
    vspi.setDataMode(SPI_MODE0);
    // 10mhz
    vspi.setFrequency(10000000);
}

void WriteTCA9534APWROutputState()
{
    if (TCA6416_Fitted)
    {
        WriteTCA6416OutputState();
    }
    else
    {
        ESP_ERROR_CHECK_WITHOUT_ABORT(writeByte(I2C_NUM_0, TCA9534APWR_ADDRESS, TCA9534APWR_OUTPUT, TCA9534APWR_Output_Pins));
    }
}
void WriteTCA6408OutputState()
{
    if (TCA6416_Fitted)
    {
        WriteTCA6416OutputState();
    }
    else
    {
        ESP_ERROR_CHECK_WITHOUT_ABORT(writeByte(I2C_NUM_0, TCA6408_ADDRESS, TCA6408_OUTPUT, TCA6408_Output_Pins));
    }
}

void TFTScreenBacklight(bool value)
{
    // Clear LED pins
    TCA9534APWR_Value = TCA9534APWR_Value & B11110111;

    if (value == true)
    {
        // Set on
        TCA9534APWR_Value = TCA9534APWR_Value | B00001000;
    }

    WriteTCA9534APWROutputState();

    // esp_err_t ret =
    // ESP_ERROR_CHECK_WITHOUT_ABORT(writeByte(I2C_NUM_0, TCA9534APWR_ADDRESS, TCA9534APWR_OUTPUT, TCA9534APWR_Value));
    // TODO: Check return value
    // ESP_LOGD(TAG,"TCA9534 reply %i",ret);
}

void init_tft_display()
{
    tft.init();
    tft.initDMA(); // Initialise the DMA engine (tested with STM32F446 and STM32F767)
    tft.getSPIinstance().setHwCs(false);
    tft.setRotation(3);
    tft.setTextColor(TFT_WHITE, TFT_BLACK);

    tft.setCursor(0, 48 + 16, 4);
    tft.println(F("I'm alive!"));
    TFTScreenBacklight(true);
}

void mountSDCard()
{
    /*
SD CARD TEST
*/
    ESP_LOGI(TAG, "Mounting SD card");

    if (SD.begin(SDCARD_CHIPSELECT, vspi))
    {
        uint8_t cardType = SD.cardType();
        if (cardType == CARD_NONE)
        {
            ESP_LOGI(TAG, "No SD card attached");
            Halt(RGBLED::Blue);
        }
        else
        {
            ESP_LOGI(TAG, "SD card available");
        }
    }
    else
    {
        ESP_LOGE(TAG, "Card Mount Failed");
        Halt(RGBLED::Blue);
    }
}
void testSerial()
{
    ESP_LOGI(TAG, "Test serial TX1/RX1");
    for (size_t i = 0; i < 10; i++)
    {
        delay(100);
        // Clear send and reply buffers
        SERIAL_DATA.flush();
        while (SERIAL_DATA.available())
        {
            SERIAL_DATA.read();
        }

        SERIAL_DATA.println("test!");

        Led(RGBLED::Blue);
        String reply = SERIAL_DATA.readString();

        SERIAL_DEBUG.print(i);
        SERIAL_DEBUG.print('=');
        SERIAL_DEBUG.print(reply.c_str());
        if (reply.startsWith("test!") == false)
        {
            Halt(RGBLED::White);
        }
        Led(RGBLED::OFF);
    }
}

void setup()
{
    // We are not testing ESP32, so switch off WIFI + BT
    WiFi.mode(WIFI_OFF);

