stuartpittaway/diyBMSv4ESP32/ESP32BoardTest/src/main.cpp
    btStop();
    esp_log_level_set("*", ESP_LOG_DEBUG); // set all components to DEBUG level

    SERIAL_DEBUG.begin(115200, SERIAL_8N1);
    SERIAL_DEBUG.setDebugOutput(true);

    vspi = SPIClass(VSPI);

    ConfigurePins();
    ConfigureI2C();
    ConfigureVSPI();

    mountSDCard();

    // Create a test file

    File file;
    const char *filename = "/burnin.txt";

    if (SD.exists(filename))
    {
        file = SD.open(filename, FILE_APPEND);
        ESP_LOGD(TAG, "Open %s", filename);
    }
    else
    {
        File file = SD.open(filename, FILE_WRITE);
        if (file)
        {
            ESP_LOGI(TAG, "Created %s", filename);
        }
        else
        {
            Halt(RGBLED::Blue);
        }
    }

    file.println("Mary had a little lamb...");
    file.close();

    ESP_LOGI(TAG, "All good for SD card file %s", filename);
    SD.end();

    // Test SERIAL
    SERIAL_DATA.begin(2400, SERIAL_8N1, 2, 32); // Serial for comms to modules
    testSerial();

    init_tft_display();
}

void SetOutputState(uint8_t outputId, bool state)
{
    ESP_LOGD(TAG, "SetOutputState %u=%u", outputId, state);

    // Relays connected to TCA6408A
    // P4 = RELAY1 (outputId=0)
    // P5 = RELAY2 (outputId=1)
    // P6 = RELAY3_SSR (outputId=2)
    // P7 = EXT_IO_E (outputId=3)

    if (outputId <= 3)
    {
        TCA6408_Value = readByte(I2C_NUM_0, TCA6408_ADDRESS, TCA6408_INPUT);
        uint8_t bit = outputId + 4;
        TCA6408_Value = (state == true) ? (TCA6408_Value | (1 << bit)) : (TCA6408_Value & ~(1 << bit));
        esp_err_t ret = writeByte(I2C_NUM_0, TCA6408_ADDRESS, TCA6408_OUTPUT, TCA6408_Value);
        // ESP_LOGD(TAG, "TCA6408 reply %i", ret);

        if (ret != ESP_OK)
        {
            Halt(RGBLED::Green);
        }

        // TODO: Check return value
        TCA6408_Value = readByte(I2C_NUM_0, TCA6408_ADDRESS, TCA6408_INPUT);
    }
}

struct TouchScreenValues
{
    bool touched;
    uint8_t pressure;
    uint16_t X;
    uint16_t Y;
};

TouchScreenValues TouchScreenUpdate()
{
    /*
        Features and Specification of XPT2046
        * 12 bit SAR type A/D converter with S/H circuit
        * Low voltage operations (VCC = 2.2V - 3.6V)
        * Low power consumption (260uA)
        * 125 kHz sampling frequency
        * On-chip reference voltage - 2.5V
        * Pen pressure measurement
        * On-chip thermo sensor
        * Direct battery measurement
        * 4-wire I/F

        DataSheet
        https://components101.com/admin/sites/default/files/component_datasheet/XPT2046-Datasheet.pdf

        // BIT7(MSB) BIT6 BIT5 BIT4 BIT3 BIT2      BIT1 BIT0(LSB)
        // S         A2   A1   A0   MODE SER/——DFR PD1  PD0

        // S = START BIT
        // A2/A1/A0 = Channel address bits 011 = Z1, 100=Z2, 001=X, 101=Y
        // MODE = 12bit/8bit (12bit=low)
        // SER/DFR = SingleEnded/Differential ADC mode (differential mode)
        // PD0 and PD1 control power delivery, 0/0 = all enabled, 1=1=disabled.
    */
    // Z is touch (depth)
    // const uint8_t ADD_TEMPERATURE = 0B00000000;
    // const uint8_t ADD_VBATTERY = 0B00100000;
    const uint8_t ADD_Z1 = 0B00110000;
    const uint8_t ADD_Z2 = 0B01000000;
    const uint8_t ADD_X = 0B00010000;
    const uint8_t ADD_Y = 0B01010000;
    const uint8_t STARTBIT = 0B10000000;
    // internal reference voltage is only used in the single-ended mode for battery monitoring, temperature measurement
    const uint8_t PWR_ALLOFF = 0B00000000;
    const uint8_t PWR_REFOFF_ADCON = 0B00000001;
    // const uint8_t PWR_REFON_ADCOFF = 0B00000010;
    // const uint8_t PWR_REFON_ADCON = 0B00000011;

    // Differential Reference Mode (SER/DFR low) should be used for reading X/Y/Z
    // Single ended mode (SER/DFR high) should be used for temperature and battery
    const uint8_t ADC_DIFFERENTIAL = 0B00000000;
    // const uint8_t ADC_SINGLEENDED = 0B00000100;

    const uint8_t ADC_8BIT = 0B00001000;
    const uint8_t ADC_12BIT = 0B00000000;

    TouchScreenValues reply;
    reply.touched = false;
    reply.pressure = 0;
    reply.X = 0;
    reply.Y = 0;

    // Landscape orientation screen
    // X is zero when not touched, left of screen is about 290, right of screen is about 3900
    // Y is 3130 when not touched, top of screen is 250, bottom is 3150

    // Slow down to 2Mhz SPI bus
    vspi.beginTransaction(SPISettings(2000000, MSBFIRST, SPI_MODE0));

    digitalWrite(TOUCH_CHIPSELECT, LOW);

    // We don't need accurate touch pressure for this application, so
    // only read Z2 register, we just want a boolean value at the end of the day

    // The transfers are always a step behind, so the transfer reads the previous value/command
    vspi.write(STARTBIT | PWR_REFOFF_ADCON | ADC_8BIT | ADC_DIFFERENTIAL | ADD_Z1);

    // Read Z2 (1 byte) and request X
    reply.pressure = vspi.transfer(STARTBIT | PWR_REFOFF_ADCON | ADC_12BIT | ADC_DIFFERENTIAL | ADD_X);

    // Read X (2 bytes) and request Y
    reply.X = vspi.transfer16(STARTBIT | PWR_REFOFF_ADCON | ADC_12BIT | ADC_DIFFERENTIAL | ADD_Y) >> 3;
    // Take Y reading, then power down after this sample
    reply.Y = vspi.transfer16(STARTBIT | PWR_ALLOFF | ADC_8BIT | ADC_DIFFERENTIAL | ADD_Z2) >> 3;

    // Final transfer to ensure device goes into sleep
    // In order to turn the reference off, an additional write to the XPT2046 is required after the channel has been converted.  Page 24 datasheet
    // uint16_t Z2 =
    vspi.transfer(0);

    digitalWrite(TOUCH_CHIPSELECT, HIGH);
    vspi.endTransaction();

    // Screen connected and not touched
    // Touch = 128, x=0 , y around 3130-3140

    // 135 controls the minimum amount of pressure needed to "touch"
    // X also needs to be greater than zero
    reply.touched = reply.pressure > 135 && reply.X > 0;

    // ESP_LOGI(TAG, "Touch = touch=%i pressure=%u x=%u y=%u", reply.touched, reply.pressure, reply.X, reply.Y);

    return reply;
}

uint8_t output = 0;
bool state = true;
void loop()
{
    SetOutputState(output, state);
    output++;
    if (output > 3)
    {
        output = 0;
        state = !state;
    }

    TouchScreenValues touchscreen = TouchScreenUpdate();

    if (touchscreen.touched)
    {
        tft.setTextColor(TFT_GREEN, TFT_BLACK);
        tft.setCursor(0, 100, 2);
        tft.print(millis());
        tft.print("Pressure = ");
        tft.print(touchscreen.pressure);
        tft.print(", x = ");
        tft.print(touchscreen.X);
        tft.print(", y = ");
        tft.print(touchscreen.Y);
    }
    else
    {
        tft.fillRect(0, 100, 320, 16, TFT_WHITE);
    }

    tft.setTextColor(TFT_GREEN, TFT_BLACK);
    tft.setCursor(0, 16, 4);
    tft.print(millis());

    Led(RGBLED::Green);
    // Don't do anything
    delay(250);
    Led(RGBLED::OFF);
    // Don't do anything
    delay(250);
}